export const planData = [
    {
        id: 1,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-01T09:00:00",
        end: "2025-08-01T18:00:00"
    },
    {
        id: 2,
        employee: "Петров П.П.",
        store: "Магазин №1",
        role: "Администратор",
        start: "2025-08-01T10:00:00",
        end: "2025-08-01T19:00:00"
    },
    {
        id: 3,
        employee: "Сидоров С.С.",
        store: "Магазин №2",
        role: "Кассир",
        start: "2025-08-01T08:00:00",
        end: "2025-08-01T17:00:00"
    },
    {
        id: 4,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-02T09:00:00",
        end: "2025-08-02T18:00:00"
    },
    {
        id: 5,
        employee: "Петров П.П.",
        store: "Магазин №1",
        role: "Администратор",
        start: "2025-08-02T12:00:00",
        end: "2025-08-02T21:00:00"
    },
    {
        id: 6,
        employee: "Сидоров С.С.",
        store: "Магазин №2",
        role: "Кассир",
        start: "2025-08-02T08:00:00",
        end: "2025-08-02T17:00:00"
    },
    {
        id: 7,
        employee: "Сидоров С.С.",
        store: "Магазин №2",
        role: "Кассир",
        start: "2025-08-03T08:00:00",
        end: "2025-08-03T17:00:00"
    },
    {
        id: 8,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-04T09:00:00",
        end: "2025-08-04T18:00:00"
    },
];

export const factData = [
    {
        id: 1,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-01T11:15:00",
        end: "2025-08-01T16:45:00"
    },
    {
        id: 2,
        employee: "Петров П.П.",
        store: "Магазин №1",
        role: "Администратор",
        start: "2025-08-01T10:00:00",
        end: "2025-08-01T19:00:00"
    },
    {
        id: 3,
        employee: "Сидоров С.С.",
        store: "Магазин №2",
        role: "Кассир",
        start: "2025-08-01T08:00:00",
        end: "2025-08-01T12:30:00"
    },
    {
        id: 4,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-02T09:00:00",
        end: "2025-08-02T18:00:00"
    },
    {
        id: 5,
        employee: "Петров П.П.",
        store: "Магазин №1",
        role: "Администратор",
        start: "2025-08-02T16:30:00", 
        end: "2025-08-02T23:00:00"
    },
    {
        id: 8,
        employee: "Иванов И.И.",
        store: "Магазин №1",
        role: "Кассир",
        start: "2025-08-04T11:00:00",
        end: "2025-08-04T18:00:00"
    },
    // Сидоров отсутствовал 2 октября
];
